Repository: bkrsmanovic/wp-cais-plugin
Catalog: languages/context-ai-search-*.po
Languages: ar, nl_nl, sr_rs

source: Context AI Search
ar: بحث السياقي بالذكاء الاصطناعي
nl_nl: Context AI Zoeken
sr_rs: Context AI Pretraga

source: Search Our Library
ar: ابحث في مكتبتنا
nl_nl: Doorzoek onze bibliotheek
sr_rs: Pretražite našu biblioteku

source: Ask any question and get intelligent, context-aware answers
ar: اطرح أي سؤال واحصل على إجابات ذكية ومراعية للسياق
nl_nl: Stel vragen en krijg intelligente, contextbewuste antwoorden
sr_rs: Postavite bilo koje pitanje i dobijte inteligentne, kontekstualne odgovore

source: Type your question here...
ar: اكتب سؤالك هنا...
nl_nl: Typ hier uw vraag...
sr_rs: Unesite vaše pitanje ovde...

source: Enter your question above to get started.
ar: أدخل سؤالك أعلاه للبدء.
nl_nl: Voer hierboven uw vraag in om te beginnen.
sr_rs: Unesite vaše pitanje iznad da biste počeli.

source: Need more help?
ar: تحتاج إلى مساعدة إضافية؟
nl_nl: Heeft u meer hulp nodig?
sr_rs: Trebate više pomoći?

source: or
ar: أو
nl_nl: of
sr_rs: ili

source: Searching...
ar: جاري البحث...
nl_nl: Zoeken...
sr_rs: Pretraživanje...

source: An error occurred. Please try again.
ar: حدث خطأ. يرجى المحاولة مرة أخرى.
nl_nl: Er is een fout opgetreden. Probeer het opnieuw.
sr_rs: Došlo je do greške. Molimo pokušajte ponovo.

source: WP CAIS not configured properly. Please check your API key settings.
ar: CAIS غير مُكوّن بشكل صحيح. يرجى التحقق من إعدادات مفتاح API الخاص بك.
nl_nl: CAIS is niet correct geconfigureerd. Controleer uw API-sleutelinstellingen.
sr_rs: CAIS nije pravilno konfigurisan. Molimo proverite postavke vašeg API ključa.

source: I found %d relevant result(s) for your query: "%s".
ar: وجدت %d نتيجة ذات صلة لاستفسارك: "%s".
nl_nl: Ik heb %d relevant(e) resultaat(en) gevonden voor uw zoekopdracht: "%s".
sr_rs: Pronašao sam %d relevantan(ih) rezultat(a) za vaš upit: "%s".

source: Here are the most relevant sources:
ar: إليك المصادر الأكثر صلة:
nl_nl: Hier zijn de meest relevante bronnen:
sr_rs: Evo najrelevantnijih izvora:

source: I couldn't find specific information about that in our content.
ar: لم أتمكن من العثور على معلومات محددة حول ذلك في محتوانا.
nl_nl: Ik kon geen specifieke informatie daarover vinden in onze inhoud.
sr_rs: Nisam mogao da pronađem specifične informacije o tome u našem sadržaju.

source: I apologize for the inconvenience. Please feel free to contact us for more information.
ar: أعتذر عن الإزعاج. لا تتردد في الاتصال بنا للحصول على مزيد من المعلومات.
nl_nl: Ik verontschuldig me voor het ongemak. Neem gerust contact met ons op voor meer informatie.
sr_rs: Izvinjavam se zbog neprijatnosti. Slobodno nas kontaktirajte za više informacija.

source: You can reach us:
ar: يمكنك الوصول إلينا:
nl_nl: U kunt ons bereiken:
sr_rs: Možete nas kontaktirati:

source: Free Features
ar: الميزات المجانية
nl_nl: Gratis functies
sr_rs: Besplatne funkcije

source: Premium Features
ar: الميزات المميزة
nl_nl: Premium functies
sr_rs: Premium funkcije

source: Get Premium
ar: احصل على Premium
nl_nl: Krijg Premium
sr_rs: Nabavite Premium

source: Upgrade Now
ar: ترقية الآن
nl_nl: Nu upgraden
sr_rs: Nadogradite sada

source: Save Settings
ar: حفظ الإعدادات
nl_nl: Instellingen opslaan
sr_rs: Sačuvaj postavke

source: Test API Key
ar: اختبار مفتاح API
nl_nl: API-sleutel testen
sr_rs: Testiraj API ključ

source: API key is valid!
ar: مفتاح API صالح!
nl_nl: API-sleutel is geldig!
sr_rs: API ključ je važeći!

source: API key is invalid
ar: مفتاح API غير صالح
nl_nl: API-sleutel is ongeldig
sr_rs: API ključ nije važeći

source: Simplify all answers
ar: تبسيط جميع الإجابات
nl_nl: Vereenvoudig alle antwoorden
sr_rs: Pojednostavite sve odgovore

source: Address users in friendly manner
ar: التعامل مع المستخدمين بطريقة ودية
nl_nl: Spreek gebruikers op een vriendelijke manier aan
sr_rs: Obraćajte se korisnicima na prijateljski način

source: Add Custom Rule
ar: إضافة قاعدة مخصصة
nl_nl: Aangepaste regel toevoegen
sr_rs: Dodaj prilagođeno pravilo

source: Remove
ar: إزالة
nl_nl: Verwijderen
sr_rs: Ukloni

source: Settings saved successfully.
ar: تم حفظ الإعدادات بنجاح.
nl_nl: Instellingen succesvol opgeslagen.
sr_rs: Postavke su uspešno sačuvane.

source: Contact Information
ar: معلومات الاتصال
nl_nl: Contactgegevens
sr_rs: Kontakt informacije

source: Phone Number
ar: رقم الهاتف
nl_nl: Telefoonnummer
sr_rs: Broj telefona

source: Address
ar: العنوان
nl_nl: Adres
sr_rs: Adresa

source: AI Configuration
ar: تكوين الذكاء الاصطناعي
nl_nl: AI-configuratie
sr_rs: AI konfiguracija

source: AI Provider
ar: مزود الذكاء الاصطناعي
sr_rs: AI provajder

source: API Key
ar: مفتاح API
nl_nl: API-sleutel
sr_rs: API ključ

source: Database Status
ar: حالة قاعدة البيانات
sr_rs: Status baze podataka

source: Create Cache Table
ar: إنشاء جدول التخزين المؤقت
nl_nl: Cache-tabel aanmaken
sr_rs: Kreiraj cache tabelu

source: Table created successfully!
ar: تم إنشاء الجدول بنجاح!
nl_nl: Tabel succesvol aangemaakt!
sr_rs: Tabela je uspešno kreirana!

source: Currently %d cached entries.
ar: حاليًا %d إدخالاً مخزناً مؤقتاً.
nl_nl: Momenteel %d gecachte items.
sr_rs: Trenutno %d keširanih unosa.

source: Table exists
ar: الجدول موجود
nl_nl: Tabel bestaat
sr_rs: Tabela postoji

source: Table does not exist
ar: الجدول غير موجود
nl_nl: Tabel bestaat niet
sr_rs: Tabela ne postoji

source: The cache table is required for storing search results. Click the button below to create it.
ar: جدول التخزين المؤقت مطلوب لتخزين نتائج البحث. انقر على الزر أدناه لإنشائه.
nl_nl: De cache-tabel is vereist voor het opslaan van zoekresultaten. Klik op de knop hieronder om deze aan te maken.
sr_rs: Cache tabela je potrebna za čuvanje rezultata pretrage. Kliknite na dugme ispod da biste je kreirali.

source: You are a helpful assistant that answers questions based on content from a WordPress website.
ar: أنت مساعد مفيد يجيب على الأسئلة بناءً على المحتوى من موقع WordPress.
nl_nl: Je bent een behulpzame assistent die vragen beantwoordt op basis van inhoud van een WordPress-website.
sr_rs: Vi ste koristan asistent koji odgovara na pitanja na osnovu sadržaja sa WordPress sajta.

source: Keep your answers simple and easy to understand.
ar: اجعل إجاباتك بسيطة وسهلة الفهم.
nl_nl: Houd je antwoorden eenvoudig en gemakkelijk te begrijpen.
sr_rs: Držite vaše odgovore jednostavnim i lako razumljivim.

source: Use a friendly and professional tone.
ar: استخدم نغمة ودية ومهنية.
nl_nl: Gebruik een vriendelijke en professionele toon.
sr_rs: Koristite prijateljski i profesionalan ton.

source: If you cannot find the answer in the provided context, apologize and suggest contacting the website for more information.
ar: إذا لم تتمكن من العثور على الإجابة في السياق المقدم، اعتذر واقترح الاتصال بالموقع لمزيد من المعلومات.
nl_nl: Als je het antwoord niet kunt vinden in de verstrekte context, verontschuldig je dan en stel voor om contact op te nemen met de website voor meer informatie.
sr_rs: Ako ne možete da pronađete odgovor u datom kontekstu, izvinite se i predložite kontaktiranje sajta za više informacija.

source: Only use information from the provided context. If the context does not contain the answer, say so clearly.
ar: استخدم فقط المعلومات من السياق المقدم. إذا كان السياق لا يحتوي على الإجابة، قل ذلك بوضوح.
nl_nl: Gebruik alleen informatie uit de verstrekte context. Als de context het antwoord niet bevat, zeg dit dan duidelijk.
sr_rs: Koristite samo informacije iz datog konteksta. Ako kontekst ne sadrži odgovor, jasno to recite.

source: Invalid API key. Please check your API key.
ar: مفتاح API غير صالح. يرجى التحقق من مفتاح API الخاص بك.
nl_nl: Ongeldige API-sleutel. Controleer uw API-sleutel.
sr_rs: Nevažeći API ključ. Molimo proverite vaš API ključ.

source: Could not connect to OpenAI API.
ar: تعذر الاتصال بـ OpenAI API.
nl_nl: Kon geen verbinding maken met OpenAI API.
sr_rs: Nije moguće povezati se sa OpenAI API.

source: Could not validate API key. Please try again.
ar: تعذر التحقق من مفتاح API. يرجى المحاولة مرة أخرى.
nl_nl: Kon API-sleutel niet valideren. Probeer het opnieuw.
sr_rs: Nije moguće potvrditi API ključ. Molimo pokušajte ponovo.

source: Invalid response from AI service.
ar: استجابة غير صالحة من خدمة الذكاء الاصطناعي.
nl_nl: Ongeldig antwoord van AI-service.
sr_rs: Nevažeći odgovor od AI servisa.

source: Unknown error creating table.
ar: خطأ غير معروف عند إنشاء الجدول.
nl_nl: Onbekende fout bij het aanmaken van de tabel.
sr_rs: Nepoznata greška pri kreiranju tabele.
