Repository: bkrsmanovic/wp-cais-plugin
Catalog: languages/wp-context-ai-search-*.po
Languages: es_es, nb_no

source: WP Context AI Search
es_es: Búsqueda IA Contexto WP
nb_no: WP Context AI-søk

source: Search Our Library
es_es: Buscar en nuestra biblioteca
nb_no: Søk i vårt bibliotek

source: Ask any question and get intelligent, context-aware answers
es_es: Haz cualquier pregunta y obtén respuestas inteligentes y contextuales
nb_no: Still spørsmål og få intelligente, kontekstbevisste svar

source: Type your question here...
es_es: Escribe tu pregunta aquí...
nb_no: Skriv spørsmålet ditt her...

source: Enter your question above to get started.
es_es: Ingresa tu pregunta arriba para comenzar.
nb_no: Skriv inn spørsmålet ditt over for å komme i gang.

source: Need more help?
es_es: ¿Necesitas más ayuda?
nb_no: Trenger du mer hjelp?

source: or
es_es: o
nb_no: eller

source: Searching...
es_es: Buscando...
nb_no: Søker...

source: An error occurred. Please try again.
es_es: Ocurrió un error. Por favor, inténtalo de nuevo.
nb_no: En feil oppstod. Vennligst prøv igjen.

source: WP CAIS not configured properly. Please check your API key settings.
es_es: WP CAIS no está configurado correctamente. Por favor, verifica la configuración de tu clave API.
nb_no: WP CAIS er ikke konfigurert riktig. Vennligst sjekk API-nøkkelinnstillingene dine.

source: I found %d relevant result(s) for your query: "%s".
es_es: Encontré %d resultado(s) relevante(s) para tu consulta: "%s".
nb_no: Jeg fant %d relevante resultat(er) for spørringen din: "%s".

source: Here are the most relevant sources:
es_es: Aquí están las fuentes más relevantes:
nb_no: Her er de mest relevante kildene:

source: I couldn't find specific information about that in our content.
es_es: No pude encontrar información específica sobre eso en nuestro contenido.
nb_no: Jeg kunne ikke finne spesifikk informasjon om det i innholdet vårt.

source: I apologize for the inconvenience. Please feel free to contact us for more information.
es_es: Me disculpo por las molestias. Por favor, no dudes en contactarnos para más información.
nb_no: Jeg beklager uleiligheten. Ta gjerne kontakt med oss for mer informasjon.

source: You can reach us:
es_es: Puedes contactarnos:
nb_no: Du kan nå oss:

source: Free Features
es_es: Características gratuitas
nb_no: Gratisfunksjoner

source: Premium Features
es_es: Características Premium
nb_no: Premium-funksjoner

source: Get Premium
es_es: Obtener Premium
nb_no: Få Premium

source: Upgrade Now
es_es: Actualizar ahora
nb_no: Oppgrader nå

source: Save Settings
es_es: Guardar configuración
nb_no: Lagre innstillinger

source: Test API Key
es_es: Probar clave API
nb_no: Test API-nøkkel

source: API key is valid!
es_es: ¡La clave API es válida!
nb_no: API-nøkkel er gyldig!

source: API key is invalid
es_es: La clave API no es válida
nb_no: API-nøkkel er ugyldig

source: Simplify all answers
es_es: Simplificar todas las respuestas
nb_no: Forenkle alle svar

source: Address users in friendly manner
es_es: Dirigirse a los usuarios de manera amigable
nb_no: Adresser brukere på en vennlig måte

source: Add Custom Rule
es_es: Agregar regla personalizada
nb_no: Legg til tilpasset regel

source: Remove
es_es: Eliminar
nb_no: Fjern

source: Settings saved successfully.
es_es: Configuración guardada exitosamente.
nb_no: Innstillinger lagret.

source: Contact Information
es_es: Información de contacto
nb_no: Kontaktinformasjon

source: Phone Number
es_es: Número de teléfono
nb_no: Telefonnummer

source: Address
es_es: Dirección
nb_no: Adresse

source: AI Configuration
es_es: Configuración de IA
nb_no: AI-konfigurasjon

source: AI Provider
es_es: Proveedor de IA
nb_no: AI-leverandør

source: API Key
es_es: Clave API
nb_no: API-nøkkel

source: Database Status
es_es: Estado de la base de datos

source: Create Cache Table
es_es: Crear tabla de caché
nb_no: Opprett cache-tabell

source: Table created successfully!
es_es: ¡Tabla creada exitosamente!
nb_no: Tabell opprettet!

source: Currently %d cached entries.
es_es: Actualmente %d entradas en caché.
nb_no: For øyeblikket %d cachede oppføringer.

source: Table exists
es_es: La tabla existe
nb_no: Tabell eksisterer

source: Table does not exist
es_es: La tabla no existe
nb_no: Tabell eksisterer ikke

source: The cache table is required for storing search results. Click the button below to create it.
es_es: La tabla de caché es necesaria para almacenar los resultados de búsqueda. Haz clic en el botón a continuación para crearla.
nb_no: Cache-tabellen er nødvendig for å lagre søkeresultater. Klikk på knappen nedenfor for å opprette den.

source: You are a helpful assistant that answers questions based on content from a WordPress website.
es_es: Eres un asistente útil que responde preguntas basándose en el contenido de un sitio web de WordPress.
nb_no: Du er en hjelpsom assistent som svarer på spørsmål basert på innhold fra en WordPress-nettsted.

source: Keep your answers simple and easy to understand.
es_es: Mantén tus respuestas simples y fáciles de entender.
nb_no: Hold svarene dine enkle og lette å forstå.

source: Use a friendly and professional tone.
es_es: Usa un tono amigable y profesional.
nb_no: Bruk en vennlig og profesjonell tone.

source: If you cannot find the answer in the provided context, apologize and suggest contacting the website for more information.
es_es: Si no puedes encontrar la respuesta en el contexto proporcionado, disculpa y sugiere contactar el sitio web para más información.
nb_no: Hvis du ikke kan finne svaret i den gitte konteksten, beklag og foreslå å kontakte nettstedet for mer informasjon.

source: Only use information from the provided context. If the context does not contain the answer, say so clearly.
es_es: Solo usa información del contexto proporcionado. Si el contexto no contiene la respuesta, dilo claramente.
nb_no: Bruk kun informasjon fra den gitte konteksten. Hvis konteksten ikke inneholder svaret, si det tydelig.

source: Invalid API key. Please check your API key.
es_es: Clave API no válida. Por favor, verifica tu clave API.
nb_no: Ugyldig API-nøkkel. Vennligst sjekk API-nøkkelen din.

source: Could not connect to OpenAI API.
es_es: No se pudo conectar a la API de OpenAI.
nb_no: Kunne ikke koble til OpenAI API.

source: Could not validate API key. Please try again.
es_es: No se pudo validar la clave API. Por favor, inténtalo de nuevo.
nb_no: Kunne ikke validere API-nøkkel. Vennligst prøv igjen.

source: Invalid response from AI service.
es_es: Respuesta no válida del servicio de IA.
nb_no: Ugyldig svar fra AI-tjenesten.

source: Unknown error creating table.
es_es: Error desconocido al crear la tabla.
nb_no: Ukjent feil ved oppretting av tabell.
